wrk/output/stage_6/2_put_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 781.068ms, rate sampling interval: 2050ms
  Thread calibration: mean lat.: 732.198ms, rate sampling interval: 1891ms
  Thread calibration: mean lat.: 781.904ms, rate sampling interval: 2091ms
  Thread calibration: mean lat.: 786.295ms, rate sampling interval: 2092ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   276.80ms  377.59ms   1.04s    75.31%
    Req/Sec   262.11     20.23   318.00     81.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.07ms
 75.000%  642.56ms
 90.000%  912.90ms
 99.000%    1.01s 
 99.900%    1.03s 
 99.990%    1.04s 
 99.999%    1.04s 
100.000%    1.04s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.060     0.000000            1         1.00
       1.934     0.100000         2097         1.11
       2.207     0.200000         4207         1.25
       2.447     0.300000         6283         1.43
       2.787     0.400000         8376         1.67
       4.071     0.500000        10463         2.00
       7.959     0.550000        11510         2.22
      22.751     0.600000        12556         2.50
     292.351     0.650000        13602         2.86
     514.047     0.700000        14649         3.33
     642.559     0.750000        15695         4.00
     726.015     0.775000        16228         4.44
     781.823     0.800000        16741         5.00
     826.879     0.825000        17265         5.71
     860.671     0.850000        17795         6.67
     885.247     0.875000        18311         8.00
     901.119     0.887500        18573         8.89
     913.407     0.900000        18841        10.00
     926.207     0.912500        19102        11.43
     936.959     0.925000        19378        13.33
     946.687     0.937500        19626        16.00
     953.343     0.943750        19749        17.78
     960.511     0.950000        19892        20.00
     967.167     0.956250        20011        22.86
     973.823     0.962500        20150        26.67
     983.039     0.968750        20282        32.00
     986.111     0.971875        20344        35.56
     988.159     0.975000        20406        40.00
     991.231     0.978125        20478        45.71
     993.791     0.981250        20541        53.33
     997.375     0.984375        20609        64.00
     998.911     0.985938        20638        71.11
    1000.959     0.987500        20668        80.00
    1003.519     0.989062        20704        91.43
    1005.567     0.990625        20735       106.67
    1007.615     0.992188        20764       128.00
    1008.639     0.992969        20779       142.22
    1010.175     0.993750        20801       160.00
    1011.711     0.994531        20812       182.86
    1017.855     0.995313        20830       213.33
    1019.391     0.996094        20847       256.00
    1020.927     0.996484        20854       284.44
    1022.463     0.996875        20863       320.00
    1023.487     0.997266        20869       365.71
    1024.511     0.997656        20877       426.67
    1026.559     0.998047        20887       512.00
    1027.583     0.998242        20890       568.89
    1028.607     0.998437        20895       640.00
    1029.631     0.998633        20901       731.43
    1030.143     0.998828        20902       853.33
    1030.655     0.999023        20908      1024.00
    1030.655     0.999121        20908      1137.78
    1031.167     0.999219        20911      1280.00
    1031.679     0.999316        20913      1462.86
    1032.191     0.999414        20914      1706.67
    1033.727     0.999512        20916      2048.00
    1035.775     0.999561        20917      2275.56
    1037.311     0.999609        20920      2560.00
    1037.311     0.999658        20920      2925.71
    1037.311     0.999707        20920      3413.33
    1037.823     0.999756        20921      4096.00
    1038.335     0.999780        20922      4551.11
    1038.335     0.999805        20922      5120.00
    1039.359     0.999829        20923      5851.43
    1039.359     0.999854        20923      6826.67
    1040.383     0.999878        20924      8192.00
    1040.383     0.999890        20924      9102.22
    1040.383     0.999902        20924     10240.00
    1040.895     0.999915        20925     11702.86
    1040.895     0.999927        20925     13653.33
    1040.895     0.999939        20925     16384.00
    1040.895     0.999945        20925     18204.44
    1040.895     0.999951        20925     20480.00
    1041.407     0.999957        20926     23405.71
    1041.407     1.000000        20926          inf
#[Mean    =      276.796, StdDeviation   =      377.589]
#[Max     =     1040.896, Total count    =        20926]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30000 requests in 30.00s, 1.92MB read
Requests/sec:   1000.06
Transfer/sec:     65.43KB