wrk/output/stage_6/2_put_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2260.634ms, rate sampling interval: 8650ms
  Thread calibration: mean lat.: 2317.687ms, rate sampling interval: 8798ms
  Thread calibration: mean lat.: 2318.619ms, rate sampling interval: 8814ms
  Thread calibration: mean lat.: 2362.224ms, rate sampling interval: 8806ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.13s     1.86s   11.80s    67.03%
    Req/Sec   159.75     26.30   189.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.63s 
 75.000%   10.63s 
 90.000%   11.26s 
 99.000%   11.68s 
 99.900%   11.78s 
 99.990%   11.80s 
 99.999%   11.80s 
100.000%   11.80s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4689.919     0.000000            1         1.00
    6094.847     0.100000         1308         1.11
    7401.471     0.200000         2620         1.25
    8384.511     0.300000         3924         1.43
    9093.119     0.400000         5237         1.67
    9625.599     0.500000         6543         2.00
    9805.823     0.550000         7202         2.22
   10027.007     0.600000         7849         2.50
   10190.847     0.650000         8523         2.86
   10403.839     0.700000         9158         3.33
   10633.215     0.750000         9829         4.00
   10715.135     0.775000        10175         4.44
   10797.055     0.800000        10467         5.00
   10878.975     0.825000        10808         5.71
   10985.471     0.850000        11143         6.67
   11141.119     0.875000        11461         8.00
   11206.655     0.887500        11641         8.89
   11263.999     0.900000        11814        10.00
   11321.343     0.912500        11939        11.43
   11362.303     0.925000        12099        13.33
   11427.839     0.937500        12271        16.00
   11452.415     0.943750        12360        17.78
   11468.799     0.950000        12458        20.00
   11485.183     0.956250        12519        22.86
   11526.143     0.962500        12595        26.67
   11550.719     0.968750        12713        32.00
   11550.719     0.971875        12713        35.56
   11583.487     0.975000        12759        40.00
   11616.255     0.978125        12808        45.71
   11624.447     0.981250        12872        53.33
   11632.639     0.984375        12918        64.00
   11632.639     0.985938        12918        71.11
   11632.639     0.987500        12918        80.00
   11657.215     0.989062        12943        91.43
   11681.791     0.990625        12961       106.67
   11714.559     0.992188        12978       128.00
   11730.943     0.992969        12989       142.22
   11747.327     0.993750        13005       160.00
   11755.519     0.994531        13016       182.86
   11763.711     0.995313        13042       213.33
   11763.711     0.996094        13042       256.00
   11763.711     0.996484        13042       284.44
   11763.711     0.996875        13042       320.00
   11771.903     0.997266        13063       365.71
   11771.903     0.997656        13063       426.67
   11771.903     0.998047        13063       512.00
   11771.903     0.998242        13063       568.89
   11771.903     0.998437        13063       640.00
   11771.903     0.998633        13063       731.43
   11780.095     0.998828        13069       853.33
   11780.095     0.999023        13069      1024.00
   11780.095     0.999121        13069      1137.78
   11788.287     0.999219        13075      1280.00
   11788.287     0.999316        13075      1462.86
   11788.287     0.999414        13075      1706.67
   11788.287     0.999512        13075      2048.00
   11788.287     0.999561        13075      2275.56
   11788.287     0.999609        13075      2560.00
   11796.479     0.999658        13078      2925.71
   11796.479     0.999707        13078      3413.33
   11796.479     0.999756        13078      4096.00
   11796.479     0.999780        13078      4551.11
   11796.479     0.999805        13078      5120.00
   11796.479     0.999829        13078      5851.43
   11804.671     0.999854        13080      6826.67
   11804.671     1.000000        13080          inf
#[Mean    =     9127.139, StdDeviation   =     1862.767]
#[Max     =    11796.480, Total count    =        13080]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18357 requests in 30.00s, 1.17MB read
Requests/sec:    611.86
Transfer/sec:     40.03KB