wrk/output/stage_6/3_get_full_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 11.137ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 10.214ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 9.043ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 10.610ms, rate sampling interval: 68ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.61ms    4.10ms  47.46ms   92.41%
    Req/Sec   251.67     18.06   379.00     85.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.39ms
 75.000%    3.10ms
 90.000%    6.05ms
 99.000%   23.30ms
 99.900%   38.05ms
 99.990%   46.88ms
 99.999%   47.49ms
100.000%   47.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.956     0.000000            1         1.00
       1.741     0.100000         2005         1.11
       1.936     0.200000         4005         1.25
       2.091     0.300000         5999         1.43
       2.239     0.400000         8009         1.67
       2.393     0.500000         9996         2.00
       2.483     0.550000        11012         2.22
       2.583     0.600000        12007         2.50
       2.711     0.650000        12997         2.86
       2.871     0.700000        13997         3.33
       3.101     0.750000        14994         4.00
       3.257     0.775000        15494         4.44
       3.495     0.800000        15993         5.00
       3.827     0.825000        16493         5.71
       4.303     0.850000        16995         6.67
       5.067     0.875000        17493         8.00
       5.531     0.887500        17744         8.89
       6.047     0.900000        17992        10.00
       6.747     0.912500        18242        11.43
       7.811     0.925000        18492        13.33
       9.311     0.937500        18742        16.00
      10.191     0.943750        18868        17.78
      11.015     0.950000        18993        20.00
      12.167     0.956250        19117        22.86
      13.543     0.962500        19242        26.67
      15.071     0.968750        19370        32.00
      15.791     0.971875        19431        35.56
      16.767     0.975000        19494        40.00
      17.791     0.978125        19554        45.71
      18.991     0.981250        19617        53.33
      20.351     0.984375        19679        64.00
      21.295     0.985938        19711        71.11
      22.047     0.987500        19743        80.00
      22.879     0.989062        19773        91.43
      24.191     0.990625        19804       106.67
      25.679     0.992188        19835       128.00
      26.495     0.992969        19851       142.22
      27.103     0.993750        19867       160.00
      28.223     0.994531        19882       182.86
      29.327     0.995313        19898       213.33
      30.047     0.996094        19913       256.00
      30.831     0.996484        19921       284.44
      31.935     0.996875        19929       320.00
      32.335     0.997266        19937       365.71
      33.183     0.997656        19945       426.67
      33.919     0.998047        19952       512.00
      34.495     0.998242        19956       568.89
      35.263     0.998437        19961       640.00
      35.807     0.998633        19964       731.43
      37.663     0.998828        19968       853.33
      38.303     0.999023        19972      1024.00
      38.783     0.999121        19974      1137.78
      39.455     0.999219        19976      1280.00
      40.991     0.999316        19978      1462.86
      43.039     0.999414        19980      1706.67
      44.671     0.999512        19982      2048.00
      45.247     0.999561        19984      2275.56
      45.247     0.999609        19984      2560.00
      45.535     0.999658        19985      2925.71
      45.631     0.999707        19986      3413.33
      45.887     0.999756        19987      4096.00
      45.887     0.999780        19987      4551.11
      45.951     0.999805        19988      5120.00
      45.951     0.999829        19988      5851.43
      46.879     0.999854        19989      6826.67
      46.879     0.999878        19989      8192.00
      46.879     0.999890        19989      9102.22
      47.327     0.999902        19990     10240.00
      47.327     0.999915        19990     11702.86
      47.327     0.999927        19990     13653.33
      47.327     0.999939        19990     16384.00
      47.327     0.999945        19990     18204.44
      47.487     0.999951        19991     20480.00
      47.487     1.000000        19991          inf
#[Mean    =        3.614, StdDeviation   =        4.095]
#[Max     =       47.456, Total count    =        19991]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29999 requests in 30.00s, 2.03MB read
Requests/sec:    999.97
Transfer/sec:     69.19KB